для начала - скрипт, выводящий последние (по хронологии) 10 статей(каты)
скрипт, выводящий статью полностью
пейджинг ленты
публикация статьи
комментарии
регистрация
пользовательские настройки

собственно, достаточно для ядра

интеграция в github - много думать!!!
на основании комментария сделать статью (черновик статьи) одним кликом (причем не только своего комментария)
в статьях - тег коммент - вставлять комментарии из обсуждения (как этой так и любой другой статьи), вставлять ветки обсуждения (комментарий и все его ответы)
